# YOLOv9

# parameters
nc: 15  # number of classes

# gelan backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, BottleneckCSP, [256, 128]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, BottleneckCSP, [512, 256]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, BottleneckCSP, [512, 512]]  # 6
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 1, SPPF, [512, 5]] #8
  - [-1, 1, BottleneckCSP, [512, 256]]  # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 # 11
  - [-1, 1, BottleneckCSP, [512, 512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 # 14
  - [-1, 1, BottleneckCSP, [256, 256]]  # 15 (P3/8-small)
 
  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [-1, 1, ShiftViTBlockv2, [256]] # 17
  - [[-1, 12], 1, Concat, [1]]  # cat head P4 18
  - [-1, 1, BottleneckCSP, [512, 512]]  # 19(P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [-1, 1, ShiftViTBlockv2, [512]] # 21
  - [[-1, 9], 1, Concat, [1]]  # cat head P5 22
  - [-1, 1, BottleneckCSP, [512, 512]]  # 23 (P5/32-large)

  - [[15, 19, 23], 1, OBB, [nc,2]]  # DDetect(P3, P4, P5)